taskt/Core/Automation/Commands/FileGroup/IFileExistsFilePathProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IFileExistsFilePathProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AScriptFileCommands" [ label="AScriptFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IFileExistsFilePathProperties" [ label="IFileExistsFilePathProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AFileExistsFilePathCommands" [ label="AFileExistsFilePathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties" [ label="IFileExistsFilePathBeforeAfterPathResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties" [ label="IFileExistsFilePathPathResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ExecuteTesseractOCRCommand" [ label="ExecuteTesseractOCRCommand", ];
"taskt.Core.Automation.Commands.MailKitLoadEMailCommand" [ label="MailKitLoadEMailCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ReadJSONFileCommand" [ label="ReadJSONFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelOpenWorkbookCommand" [ label="ExcelOpenWorkbookCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExecuteOCRCommand" [ label="ExecuteOCRCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ReadTextFileCommand" [ label="ReadTextFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.WordOpenDocumentCommand" [ label="WordOpenDocumentCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ARunScriptFileCommands" [ label="ARunScriptFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UnloadScriptFileCommand" [ label="UnloadScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.LoadScriptFileCommand" [ label="LoadScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RunScriptFileCommand" [ label="RunScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" [ label="AFileExistsFilePathBeforeAfterResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" [ label="AFileExistsFilePathPathResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.RunJavaScriptFileCommand" [ label="RunJavaScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RunPowerShellScriptFileCommand" [ label="RunPowerShellScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RunBatchScriptFileCommand" [ label="RunBatchScriptFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" [ label="AFileCopyMoveFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" [ label="AFileCopySameRenameFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.OpenFileCommand" [ label="OpenFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFileInformationCommand" [ label="GetFileInformationCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CheckFileExistsCommand" [ label="CheckFileExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.DeleteFileCommand" [ label="DeleteFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" [ label="WaitForFileToExistCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyFileCommand" [ label="CopyFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveFileCommand" [ label="MoveFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" [ label="CopyFileToSameFolderCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RenameFileCommand" [ label="RenameFileCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AScriptFileCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.AFileExistsFilePathCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ExecuteTesseractOCRCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.MailKitLoadEMailCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ReadJSONFileCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ExcelOpenWorkbookCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ExecuteOCRCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ReadTextFileCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.WordOpenDocumentCommand" -> "taskt.Core.Automation.Commands.IFileExistsFilePathProperties";
"taskt.Core.Automation.Commands.ARunScriptFileCommands" -> "taskt.Core.Automation.Commands.AScriptFileCommands";
"taskt.Core.Automation.Commands.UnloadScriptFileCommand" -> "taskt.Core.Automation.Commands.AScriptFileCommands";
"taskt.Core.Automation.Commands.LoadScriptFileCommand" -> "taskt.Core.Automation.Commands.AScriptFileCommands";
"taskt.Core.Automation.Commands.RunScriptFileCommand" -> "taskt.Core.Automation.Commands.AScriptFileCommands";
"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathCommands";
"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathCommands";
"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathBeforeAfterPathResultProperties";
"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties";
"taskt.Core.Automation.Commands.RunJavaScriptFileCommand" -> "taskt.Core.Automation.Commands.ARunScriptFileCommands";
"taskt.Core.Automation.Commands.RunPowerShellScriptFileCommand" -> "taskt.Core.Automation.Commands.ARunScriptFileCommands";
"taskt.Core.Automation.Commands.RunBatchScriptFileCommand" -> "taskt.Core.Automation.Commands.ARunScriptFileCommands";
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.OpenFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.GetFileInformationCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.CheckFileExistsCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.DeleteFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.CopyFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.MoveFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
"taskt.Core.Automation.Commands.RenameFileCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
}
